TesboCFD/tutorials/verificationAndValidation/atmosphericModels/atmDownstreamDevelopment/setups.orig/common/system/sampleIso
// -*- C++ -*-

sampleIso
{
    type            surfaces;
    libs            (sampling);
    surfaceFormat   vtk;
    writeControl    writeTime;
    fields          (U k epsilon nut);

    surfaces
    {
        envelope
        {
            type        isoSurface;
            isoMethod   topo;
            isoField    k;
            isoValues   (1.28 1.29 1.30 1.31 1.32 1.33);
        }
    }
}


// *********************************************************************** //
